Update meai_nc_fdd.md
